OF_Sims/SIMPLE/Simple_SFAST_RANS_cylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }

    "(U|e|k|epsilon)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pMinFactor      0.1;
    pMaxFactor      2;
    transonic       no;
    consistent      yes;

    // residualControl
    // {
    //     p               1e-3;
    //     U               1e-4;
    //     e               1e-3;

    //     // possibly check turbulence fields
    //     "(k|epsilon|omega)" 1e-3;
    // }
}

relaxationFactors
{
    fields
    {
        p               0.9;
    }
    equations
    {
        p               0.9;
        U               0.9;
        e               0.8;
        k               0.9;
        epsilon         0.9;
    }
}

// ************************************************************************* //
