OF_Sims/SIMPLE/Simple_SFAST_RANS_cylinder/system/fvSolution_cond
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|e).*"
    {
        $p;
        tolerance       1e-05;
        relTol          0;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }
    "(k|epsilon).*"
    {
        $p;
        tolerance       1e-10;
    }
    "M"
    {
        solver          GAMG; //smoothSolver;
        smoother        DILU; //symGaussSeidel;
        tolerance       1e-04;
        relTol          0.01;
    }
    "MFinal"
    {
        solver          GAMG; //smoothSolver;
        smoother        DILU; //symGaussSeidel;
        tolerance       1e-04;
        relTol          0.01;
    }

    "N"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
    "NFinal"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
    
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors      2;
    nNonOrthogonalCorrectors 1;

    transonic            no;
}

// SIMPLE
// {
//     nNonOrthogonalCorrectors 0;
//     consistent      yes;

//     residualControl
//     {
//         p               1e-2;
//         U               1e-3;
//         "(k|epsilon|omega|f|v2)" 1e-3;
//     }
// }


// ************************************************************************* //
